CREATE TABLE `professions` (
  `id` int(11) NOT NULL,
  `stability` int(11) DEFAULT NULL,
  `freedom` double DEFAULT NULL,
  `production` double DEFAULT NULL,
  `transport` double DEFAULT NULL,
  `safety` double DEFAULT NULL,
  `culture` double DEFAULT NULL,
  `spec_tc` double DEFAULT NULL,
  `spec_gr` double DEFAULT NULL,
  `spec_f` double DEFAULT NULL,
  `spec_pc` double DEFAULT NULL,
  `spec_p` double DEFAULT NULL,
  `spec_k` double DEFAULT NULL,
  `spec_tu` double DEFAULT NULL,
  `spec_v` double DEFAULT NULL,
  `spec_sg` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

INSERT INTO `professions` (`id`, `stability`, `freedom`, `production`, `transport`, `safety`, `culture`, `spec_tc`, `spec_gr`, `spec_f`, `spec_pc`, `spec_p`, `spec_k`, `spec_tu`, `spec_v`, `spec_sg`) VALUES
(1, 1, -4.17, 50, 2.08, 0.42, -2.5, 16.39, 49.17, 32.78, -16.39, 32.78, -16.39, 32.78, 16.39, 0),
(2, 0, 2.08, 25, 2.08, 0, 2.5, 16.39, 32.78, 0, 0, 32.78, 16.39, 0, 32.78, 16.39),
(3, 0, 4.17, 25, 0, 0, 2.5, 16.39, 49.17, 0, 0, 32.78, 0, 16.39, 16.39, 16.39),
(4, 0, 0, 33.33, 2.08, 0.42, 0, 16.39, 49.17, 16.39, 0, 32.78, -16.39, 32.78, 16.39, 0),
(5, -2, 10.42, 16.67, -2.08, 1.25, -2.5, 16.39, 16.39, 32.78, 16.39, 32.78, 16.39, 0, 32.78, -16.39),
(6, 6, -6.25, -16.67, 6.25, 2.5, -10, 16.39, 16.39, 49.17, 32.78, 32.78, 16.39, 16.39, -49.17, 16.39),
(7, 0, 6.25, 16.67, 4.17, 0, -2.6, 49.17, 32.78, -49.17, 32.78, 49.17, 16.39, 32.78, -32.78, 16.39),
(8, -3, 12.5, -33.33, 10.42, -1.25, 12.5, 32.78, 16.39, -32.78, 32.78, 32.78, 32.78, 16.39, 32.78, -16.39),
(9, -3, 10.42, 0, 6.25, -1.67, 12.5, 0, 0, -16.39, 49.17, 16.39, 0, 0, 49.17, 49.17),
(10, 0, 4.17, 33.33, 0, 0, 0, 16.39, 32.78, 0, 0, 32.78, 32.78, 16.39, -16.39, 32.78),
(11, 0, 4.17, 33.33, 2.08, 0.42, -5, 16.39, 49.17, 16.39, 0, 32.78, -32.78, 32.78, 0, 32.78),
(12, 6, -12.5, 0, 0, 1.25, 7.5, 32.78, 0, 32.78, 49.17, -32.78, 32.78, 0, -16.39, 49.17),
(13, 2, 6.25, 0, -2.08, 0.42, 2.5, 0, 16.39, 32.78, 16.39, 32.78, 49.17, 0, -32.78, 32.78),
(14, -3, 8.33, 25, 0, 0.83, 0, 16.39, 32.78, 16.39, 0, 32.78, 32.78, 16.39, 16.39, -16.39),
(15, 6, -12.5, -8.33, 0, 2.08, 5, 16.39, 16.39, 49.17, 32.78, 32.78, -16.39, 16.39, -32.78, 32.78),
(16, -6, 8.33, 16.67, 2.08, 1.25, 5, 16.39, 16.39, 16.39, 0, 49.17, 49.17, 16.39, 32.78, -49.17),
(17, 5, 4.17, 8.33, 0, 0, -5, 49.17, 32.78, -49.17, 49.17, 16.39, 0, 16.39, 0, 32.78),
(18, 4, -6.25, 8.33, 4.17, 0.83, 0, 16.39, 16.39, 16.39, 32.78, 32.78, 16.39, 16.39, -16.39, 16.39),
(19, -3, 4.17, 25, 4.17, 0.83, 0, 32.78, 49.17, 16.39, 0, 32.78, 0, 32.78, 16.39, -32.78),
(20, -4, 12.5, -33.33, 8.33, -0.83, 15, 32.78, -16.39, -32.78, 49.17, 32.78, 32.78, 49.17, 49.17, -49.17),
(21, 0, -10.42, 8.33, 12.5, 0.83, 5, 16.39, 32.78, 16.39, 0, 32.78, 0, 49.17, 0, 0),
(22, -1, 6.25, 25, 8.33, -0.42, -5, 32.78, 32.78, 0, 0, 32.78, -49.17, 32.78, 32.78, 32.78);

CREATE TABLE `specs` (
  `id` varchar(20) NOT NULL,
  `name` varchar(20) NOT NULL,
  `stability` double NOT NULL,
  `freedom` double NOT NULL,
  `production` double NOT NULL,
  `transport` double NOT NULL,
  `safety` double NOT NULL,
  `culture` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

INSERT INTO `specs` (`id`, `name`, `stability`, `freedom`, `production`, `transport`, `safety`, `culture`) VALUES
('spec_f', 'Форт', 0, 0, 0, 0, 5, 0),
('spec_gr', 'Город ремёсел', 0, 0, 100, 0, 0, 0),
('spec_k', 'Курорт', 0, 10, 0, 0, 2, 0),
('spec_p', 'Полис', 0, 10, 100, 0, 0, 0),
('spec_pc', 'Политический центр', 0, 25, 0, 0, 0, 0),
('spec_sg', 'Святой город', 0, -25, -50, 10, 0, 0),
('spec_tc', 'Торговый центр', 0, 10, 50, 0, 0, 0),
('spec_tu', 'Транспортный узел', 0, 0, 0, 20, 0, 0),
('spec_v', 'Вольница', 0, 35, 0, 0, -10, 0);


ALTER TABLE `professions`
  ADD PRIMARY KEY (`id`);

ALTER TABLE `specs`
  ADD PRIMARY KEY (`id`);
COMMIT;