<?php
$riversPath = '{
    "Зираэль": {
        "x": 59,
        "y": 9,
        "path":"lllllllldddddddddddddddllldddllldddddddddrrrrruuurrrrrrrrruuuuurrrrruuuurruuuuuuurrrrrruuuuuuuurrruuu"
    },
    "Зираэль-Таур": {
        "x": 59,
        "y": 9,
        "path":"lllllllllllllwdldldllwlwllwllllllnlnuuuueuuuuuunlllllllllluuu"
    },
    "Зираэль-Сольв": {
        "x": 59,
        "y": 9,
        "path":"lllllllllllllwdldldldldldldwdddddwlllllwddddwlllwdddddddldldlddldldldllllllnunlllll"
    },
    "Саазар": {
        "x": 138,
        "y": 95,
        "path":"dwdwdwdwdddrrdddrrdrrrsrsrsrsrdrdrsdsddddsdsd"
    },
    "Саазар-Карахен": {
        "x": 138,
        "y": 95,
        "path":"dwdwdwdwdllddldlldddllwlwlwdllwllnllnllnullnlwddsdsrdsrddddlllddlldldlddrdrddddddlwdwdwd"
    },
    "Река Белая": {
        "x": 44,
        "y": 34,
        "path":"dddwlddlllllwdddddddddwdwddddwdlllllllnunllllllllllllllllllll"
    },
    "Река Болотная": {
        "x": 80,
        "y": 163,
        "path":"ddddrdrdddrdrdrdrddddrrdrdrddrrrrdsdsdddddsddddsdrrrrrrrrrrrdrrrrrrrrrerrrrrrrrrrrrrrsrrrrrdddrrrrrrrrrdrrrrrrrrrrrrrrrrrrrruurrrrrrrrrrrrrrrrrrrurrrrrrrrrrrrdrrrrrrrrrdrrrrrrrrrrrrrr"
    },
    "Река Холодная": {
        "x": 116,
        "y": 24,
        "path":"rrddrdrdrdrrrrrrsrddsrrrrrrdrrrd"
    },
    "Река Пепельная": {
        "x": 170,
        "y": 37,
        "path":"lllllddllddddldl"
    },
    "Река Морка": {
        "x": 109,
        "y": 24,
        "path":"uuuuruuuuuuurruurruurrrruurrrrrrrrrrddrrrrrrddrrrrrrrruuuurrrruurrrrrruuuurrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrdrrrrrrrrrrrrrrr"
    }
}';
$lakeBioms = '{
    "Черноград-ближ-1": {
        "x": 137,
        "y": 13
    },
    "Черноград-ближ-2": {
        "x": 137,
        "y": 14
    },
    "Черноград-ближ-3": {
        "x": 138,
        "y": 13
    },
    "Черноград-ближ-4": {
        "x": 138,
        "y": 14
    },
    "Черноград-прав-1": {
        "x": 139,
        "y": 6
    },
    "Черноград-прав-2": {
        "x": 139,
        "y": 7
    },
    "Черноград-прав-3": {
        "x": 139,
        "y": 8
    },
    "Черноград-прав-4": {
        "x": 137,
        "y": 6
    },
    "Черноград-прав-5": {
        "x": 137,
        "y": 7
    },
    "Черноград-прав-6": {
        "x": 137,
        "y": 8
    },
    "Черноград-прав-7": {
        "x": 138,
        "y": 6
    },
    "Черноград-прав-8": {
        "x": 138,
        "y": 7
    },
    "Черноград-прав-9": {
        "x": 138,
        "y": 8
    },
    "Черноград-дал-1": {
        "x": 123,
        "y": 9
    },
    "Сольвейг-1": {
        "x": 5,
        "y": 41
    },
    "Сольвейг-2": {
        "x": 5,
        "y": 42
    },
    "Сольвейг-3": {
        "x": 6,
        "y": 40
    },
    "Сольвейг-4": {
        "x": 6,
        "y": 41
    },
    "Сольвейг-5": {
        "x": 6,
        "y": 42
    },
    "Сольвейг-6": {
        "x": 7,
        "y": 40
    },
    "Сольвейг-7": {
        "x": 7,
        "y": 41
    },
    "Сольвейг-8": {
        "x": 7,
        "y": 42
    },
    "Озёрный-лев-1": {
        "x": 65,
        "y": 72
    },
    "Озёрный-лев-2": {
        "x": 66,
        "y": 72
    },
    "Озёрный-лев-3": {
        "x": 65,
        "y": 73
    },
    "Озёрный-лев-4": {
        "x": 66,
        "y": 73
    },
    "Озёрный-прав-1": {
        "x": 70,
        "y": 74
    },
    "Озёрный-верх-1": {
        "x": 69,
        "y": 70
    },
    "Озёрный-верх-2": {
        "x": 70,
        "y": 70
    },
    "Озёрный-верх-3": {
        "x": 69,
        "y": 71
    },
    "Озёрный-верх-4": {
        "x": 70,
        "y": 71
    },
    "Коркатталь-1": {
        "x": 36,
        "y": 92
    },
    "Коркатталь-2": {
        "x": 37,
        "y": 92
    },
    "Коркатталь-3": {
        "x": 38,
        "y": 92
    },
    "Коркатталь-4": {
        "x": 36,
        "y": 93
    },
    "Коркатталь-5": {
        "x": 37,
        "y": 93
    },
    "Коркатталь-6": {
        "x": 38,
        "y": 93
    },
    "Коркатталь-7": {
        "x": 36,
        "y": 94
    },
    "Коркатталь-8": {
        "x": 37,
        "y": 94
    },
    "Коркатталь-9": {
        "x": 38,
        "y": 94
    },
    "Квасиль-1": {
        "x": 198,
        "y": 196
    },
    "Квасиль-2": {
        "x": 199,
        "y": 196
    },
    "Квасиль-3": {
        "x": 200,
        "y": 196
    },
    "Квасиль-4": {
        "x": 198,
        "y": 197
    },
    "Квасиль-5": {
        "x": 199,
        "y": 197
    },
    "Квасиль-6": {
        "x": 200,
        "y": 197
    },
    "Квасиль-7": {
        "x": 198,
        "y": 198
    },
    "Квасиль-8": {
        "x": 199,
        "y": 198
    },
    "Квасиль-9": {
        "x": 200,
        "y": 198
    },
    "Квасиль-вт-1": {
        "x": 203,
        "y": 194
    },
    "Квасиль-вт-2": {
        "x": 204,
        "y": 194
    },
    "Квасиль-вт-3": {
        "x": 205,
        "y": 194
    },
    "Квасиль-вт-4": {
        "x": 203,
        "y": 195
    },
    "Квасиль-вт-5": {
        "x": 204,
        "y": 195
    },
    "Квасиль-вт-6": {
        "x": 205,
        "y": 195
    },
    "Квасиль-вт-7": {
        "x": 203,
        "y": 196
    },
    "Квасиль-вт-8": {
        "x": 204,
        "y": 196
    },
    "Квасиль-вт-9": {
        "x": 205,
        "y": 196
    },
    "Саазар-1": {
        "x": 154,
        "y": 128
    },
    "Саазар-2": {
        "x": 154,
        "y": 129
    },
    "Саазар-3": {
        "x": 155,
        "y": 128
    },
    "Саазар-4": {
        "x": 155,
        "y": 129
    },
    "Саазар-5": {
        "x": 156,
        "y": 128
    },
    "Саазар-6": {
        "x": 156,
        "y": 129
    },
    "Саазар-7": {
        "x": 157,
        "y": 129
    },
    "Саазар-8": {
        "x": 158,
        "y": 128
    },
    "Саазар-9": {
        "x": 158,
        "y": 129
    },
    "Саазар-10": {
        "x": 159,
        "y": 128
    },
    "Саазар-11": {
        "x": 159,
        "y": 129
    },
    "Саазар-12": {
        "x": 156,
        "y": 130
    },
    "Саазар-13": {
        "x": 157,
        "y": 130
    },
    "Саазар-14": {
        "x": 158,
        "y": 130
    },
    "Саазар-15": {
        "x": 156,
        "y": 131
    },
    "Саазар-16": {
        "x": 157,
        "y": 131
    },
    "Саазар-17": {
        "x": 158,
        "y": 131
    },
    "Саазар-18": {
        "x": 157,
        "y": 132
    },
    "Саазар-19": {
        "x": 158,
        "y": 132
    },
    "Саазар-20": {
        "x": 159,
        "y": 132
    },
    "Саазар-20": {
        "x": 159,
        "y": 131
    },
    "Кострище-1": {
        "x": 106,
        "y": 11
    },
    "Кострище-2": {
        "x": 107,
        "y": 11
    },
    "Беловодье-1": {
        "x": 5,
        "y": 57
    },
    "Беловодье-2": {
        "x": 4,
        "y": 57
    },
    "Беловодье-близ-1": {
        "x": 27,
        "y": 56
    },
    "Беловодье-близ-2": {
        "x": 27,
        "y": 55
    },
    "Беловодье-близ-3": {
        "x": 26,
        "y": 55
    },
    "Беловодье-лев-1": {
        "x": 24,
        "y": 63
    },
    "Беловодье-лев-1": {
        "x": 23,
        "y": 63
    },
    "Большое-дальнее-1": {
        "x": 204,
        "y": 1
    },
    "Большое-дальнее-2": {
        "x": 205,
        "y": 1
    },
    "Большое-дальнее-3": {
        "x": 206,
        "y": 1
    },
    "Большое-дальнее-4": {
        "x": 207,
        "y": 1
    },
    "Большое-дальнее-5": {
        "x": 204,
        "y": 2
    },
    "Большое-дальнее-6": {
        "x": 205,
        "y": 2
    },
    "Большое-дальнее-7": {
        "x": 206,
        "y": 2
    },
    "Большое-дальнее-8": {
        "x": 207,
        "y": 2
    },
    "Большое-дальнее-9": {
        "x": 204,
        "y": 3
    },
    "Большое-дальнее-10": {
        "x": 205,
        "y": 3
    },
    "Большое-дальнее-11": {
        "x": 206,
        "y": 3
    },
    "Большое-дальнее-12": {
        "x": 207,
        "y": 3
    },
    "Большое-дальнее-13": {
        "x": 204,
        "y": 4
    },
    "Большое-дальнее-14": {
        "x": 205,
        "y": 4
    },
    "Большое-дальнее-15": {
        "x": 206,
        "y": 4
    },
    "Большое-дальнее-16": {
        "x": 207,
        "y": 4
    },
    "Большое-дальнее-17": {
        "x": 206,
        "y": 5
    },
    "Большое-дальнее-18": {
        "x": 207,
        "y": 5
    },
    "Большое-дальнее-19": {
        "x": 207,
        "y": 5
    },
    "Большое-дальнее-20": {
        "x": 206,
        "y": 6
    },
    "Большое-дальнее-21": {
        "x": 207,
        "y": 6
    },
    "Большое-дальнее-22": {
        "x": 208,
        "y": 6
    },
    "Большое-дальнее-23": {
        "x": 206,
        "y": 7
    },
    "Большое-дальнее-24": {
        "x": 207,
        "y": 7
    },
    "Большое-дальнее-25": {
        "x": 208,
        "y": 7
    },
    "Большое-дальнее-26": {
        "x": 204,
        "y": 6
    },
    "Большое-дальнее-27": {
        "x": 205,
        "y": 6
    },
    "Большое-дальнее-28": {
        "x": 204,
        "y": 7
    },
    "Большое-дальнее-29": {
        "x": 205,
        "y": 7
    },
    "Большое-дальнее-30": {
        "x": 204,
        "y": 8
    },
    "Большое-дальнее-31": {
        "x": 205,
        "y": 8
    },
    "Большое-дальнее-32": {
        "x": 203,
        "y": 4
    },
    "Большое-дальнее-33": {
        "x": 203,
        "y": 5
    },
    "Большое-дальнее-34": {
        "x": 203,
        "y": 6
    },
    "Нижнее-1": {
        "x": 155,
        "y": 199
    },
    "Нижнее-2": {
        "x": 156,
        "y": 199
    },
    "Нижнее-3": {
        "x": 157,
        "y": 199
    },
    "Нижнее-4": {
        "x": 155,
        "y": 200
    },
    "Нижнее-5": {
        "x": 156,
        "y": 200
    },
    "Нижнее-6": {
        "x": 157,
        "y": 200
    },
    "Нижнее-7": {
        "x": 155,
        "y": 201
    },
    "Нижнее-8": {
        "x": 156,
        "y": 201
    },
    "Нижнее-9": {
        "x": 157,
        "y": 201
    },
    "Инд-Дирна-1": {
        "x": 99,
        "y": 179
    },
    "Инд-Дирна-2": {
        "x": 100,
        "y": 179
    },
    "Инд-Дирна-3": {
        "x": 101,
        "y": 179
    },
    "Инд-Дирна-4": {
        "x": 102,
        "y": 179
    },
    "Инд-Дирна-5": {
        "x": 103,
        "y": 179
    },
    "Инд-Дирна-6": {
        "x": 99,
        "y": 180
    },
    "Инд-Дирна-7": {
        "x": 100,
        "y": 180
    },
    "Инд-Дирна-8": {
        "x": 101,
        "y": 180
    },
    "Инд-Дирна-9": {
        "x": 102,
        "y": 180
    },
    "Инд-Дирна-10": {
        "x": 103,
        "y": 180
    },
    "Инд-Дирна-11": {
        "x": 99,
        "y": 181
    },
    "Инд-Дирна-12": {
        "x": 100,
        "y": 181
    },
    "Инд-Дирна-13": {
        "x": 101,
        "y": 181
    },
    "Инд-Дирна-14": {
        "x": 102,
        "y": 181
    },
    "Инд-Дирна-15": {
        "x":103,
        "y": 181
    },
    "Инд-Дирна-16": {
        "x": 99,
        "y": 182
    },
    "Инд-Дирна-17": {
        "x": 100,
        "y": 182
    },
    "Инд-Дирна-18": {
        "x": 101,
        "y": 182
    },
    "Инд-Дирна-19": {
        "x": 102,
        "y": 182
    },
    "Инд-Дирна-20": {
        "x": 103,
        "y": 182
    },
    "Инд-Дирна-21": {
        "x": 102,
        "y": 178
    },
    "Инд-Дирна-22": {
        "x": 103,
        "y": 178
    }
}';
?>